# ####################################################################

#  Created by Encounter(R) RTL Compiler v14.10-s022_1 on Wed Aug 10 22:36:26 +0530 2016

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design MAC

create_clock -name "clk" -add -period 3.0 -waveform {0.0 1.5} [get_ports clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports reset]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports clk]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {b[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {a[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[32]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[33]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[34]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[35]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[36]}]
set_output_delay -clock [get_clocks clk] -add_delay 1.5 [get_ports {out[37]}]
set_wire_load_mode "segmented"
set_wire_load_selection_group "WireAreaForZero" -library "tcbn45gsbwpbc0d88_ccs"
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/BHDBWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/BUFFD20BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/BUFFD24BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/BUFTD20BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/BUFTD24BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/CKBD20BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/CKBD24BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/CKLHQD20BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/CKLHQD24BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/CKLNQD20BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/CKLNQD24BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/CKND20BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/CKND24BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/DCCKBD20BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/DCCKND20BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GAN2D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GAN2D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GAOI21D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GAOI21D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GAOI22D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GBUFFD1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GBUFFD2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GBUFFD3BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GBUFFD4BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GBUFFD8BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GDCAP10BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GDCAP2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GDCAP3BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GDCAP4BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GDCAPBWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GDFCNQD1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GDFQD1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GFILL10BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GFILL2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GFILL3BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GFILL4BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GFILLBWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GINVD1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GINVD2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GINVD3BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GINVD4BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GINVD8BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GMUX2D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GMUX2D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GMUX2ND1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GMUX2ND2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GND2D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GND2D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GND2D3BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GND2D4BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GND3D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GND3D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GNR2D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GNR2D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GNR3D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GNR3D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GOAI21D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GOAI21D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GOR2D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GOR2D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GSDFCNQD1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GTIEHBWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GTIELBWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GXNR2D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GXNR2D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GXOR2D1BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/GXOR2D2BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/INVD20BWP]
set_dont_use [get_lib_cells tcbn45gsbwpbc0d88_ccs/INVD24BWP]
